src/Documents/ИТ_КорректировкаВзаиморасчетовПоИнвентаризациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИТ_КорректировкаВзаиморасчетовПоИнвентаризациям</Name>
			<Comment>Корректировка взаиморасчетов по инвентаризациям (ИТ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИТ_ВзаиморасчетыСПродавцами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцам</v8:Type>
						<v8:Type>cfg:DocumentRef.ИТ_ПакетДокументовРезультатовИнвентаризации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИТ_ВидыОперацийКорректировкиВзаиморасчетовСПродавцами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинейныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодУдержания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокументаВнешнейСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзВнешнейСистемы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемыйИсточникУдержания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИТ_ПланируемыеИсточникиУдержаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Корректировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументИнвентаризации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продавец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодУдержания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипУдержания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИТ_ТипыУдержанийПоРезультатамИнвентаризаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланируемыйИсточникУдержания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИТ_ПланируемыеИсточникиУдержаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ИТ_ВидыОперацийКорректировкиВзаиморасчетовСПродавцами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ИТ_ВидыОперацийКорректировкиВзаиморасчетовСПродавцами</Name>
			<Comment>Виды операций корректировки взаиморасчетов с продавцами (ИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдержаниеИзЗП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнесениеДС</Name>
					<Comment>Внесение наличных денежных средств</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЗадолженности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ИТ_ПланируемыеИсточникиУдержаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ИТ_ПланируемыеИсточникиУдержаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИТ_КорректировкаВзаиморасчетовПоИнвентаризациям/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ВидОперации = Перечисления.ИТ_ВидыОперацийКорректировкиВзаиморасчетовСПродавцами.КорректировкаЗадолженности Тогда
		
		Движения.Ит_ВзаиморасчетыСПродавцами.Записывать = Истина;
		Для Каждого ТекСтрокаКорректировки Из Корректировки Цикл
			
			СуммаКорректировки = ТекСтрокаКорректировки.Сумма;
			
			Если СуммаКорректировки < 0 Тогда
				СуммаКорректировки = -СуммаКорректировки;
				ВидДвижения = ВидДвиженияНакопления.Расход;	
			Иначе
				ВидДвижения = ВидДвиженияНакопления.Приход;
			КонецЕсли;
			
			Движение 								= Движения.Ит_ВзаиморасчетыСПродавцами.Добавить();
			Движение.ВидДвижения					= ВидДвижения;
			Движение.Период							= Дата;
			Движение.Продавец						= ТекСтрокаКорректировки.Продавец;
			Движение.ДокументИнвентаризации 		= ТекСтрокаКорректировки.ДокументИнвентаризации;
			Движение.Магазин						= ТекСтрокаКорректировки.Магазин;
			Движение.СуммаДолга						= СуммаКорректировки;
			
			Если ЗначениеЗаполнено(ТекСтрокаКорректировки.ПланируемыйИсточникУдержания) Тогда
				Движение.ПланируемыйИсточникУдержания = ТекСтрокаКорректировки.ПланируемыйИсточникУдержания;
			Иначе
				Движение.ПланируемыйИсточникУдержания 	= ПланируемыйИсточникУдержания;
			КонецЕсли;
		
			Если ЗначениеЗаполнено(ТекСтрокаКорректировки.ПериодУдержания) Тогда
				Движение.ПериодУдержания = НачалоМесяца(ТекСтрокаКорректировки.ПериодУдержания);
			Иначе
				Движение.ПериодУдержания = НачалоМесяца(ПериодУдержания);
			КонецЕсли;
			//Если ВидОперации = Перечисления.ИТ_ВидыОперацийКорректировкиВзаиморасчетовСПродавцами.УдержаниеИзЗП Тогда
			Движение.ТипУдержания = ТекСтрокаКорректировки.ТипУдержания;
			//ИначеЕсли ВидОперации = Перечисления.ИТ_ВидыОперацийКорректировкиВзаиморасчетовСПродавцами.ВнесениеДС Тогда
			//	Движение.ТипУдержания = Перечисления.ИТ_ТипыУдержанийПоРезультатамИнвентаризаций.ПоПКО;
			//КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ВидОперации = Перечисления.ИТ_ВидыОперацийКорректировкиВзаиморасчетовСПродавцами.УдержаниеИзЗП
		Или ВидОперации = Перечисления.ИТ_ВидыОперацийКорректировкиВзаиморасчетовСПродавцами.ВнесениеДС Тогда
		
		Движения.Ит_ВзаиморасчетыСПродавцами.Записывать = Истина;
		Для Каждого ТекСтрокаКорректировки Из Корректировки Цикл
			Движение								= Движения.Ит_ВзаиморасчетыСПродавцами.Добавить();		
			Движение.ВидДвижения					= ВидДвиженияНакопления.Расход;
			Движение.Период							= Дата;
			Движение.Продавец						= ТекСтрокаКорректировки.Продавец;
			Движение.ДокументИнвентаризации 		= ТекСтрокаКорректировки.ДокументИнвентаризации;
			Движение.Магазин						= ТекСтрокаКорректировки.Магазин;
			Движение.СуммаДолга						= ТекСтрокаКорректировки.Сумма;
			Движение.ТипУдержания					= ТекСтрокаКорректировки.ТипУдержания;
			
			Если ЗначениеЗаполнено(ТекСтрокаКорректировки.ПланируемыйИсточникУдержания) Тогда
				Движение.ПланируемыйИсточникУдержания = ТекСтрокаКорректировки.ПланируемыйИсточникУдержания;
			Иначе
				Движение.ПланируемыйИсточникУдержания = ПланируемыйИсточникУдержания;
			КонецЕсли;

			Если ЗначениеЗаполнено(ТекСтрокаКорректировки.ПериодУдержания) Тогда
				Движение.ПериодУдержания = НачалоМесяца(ТекСтрокаКорректировки.ПериодУдержания);
			Иначе
				Движение.ПериодУдержания = НачалоМесяца(ПериодУдержания);
			КонецЕсли;
		КонецЦикла;
		
	//ИначеЕсли Тогда	
	ИначеЕсли ВидОперации = Перечисления.ИТ_ВидыОперацийКорректировкиВзаиморасчетовСПродавцами.СписаниеЗадолженности Тогда
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ДокументОснование") И ДанныеЗаполнения.Свойство("ТаблицаДанныхДляКорректировки") Тогда
			
			Основание = ДанныеЗаполнения.ДокументОснование;
			
			Если Не ЗначениеЗаполнено(Основание) Тогда
				Сообщить("Корректировку можно создать только на основании Пакета документов или фиксации результатов инвентаризации!");
				Возврат;
			КонецЕсли;
			
			ДеньМесяцаДляПериодаУдержания = Константы.ИТ_ДеньМесяцаДляОпределенияПериодаУдержания.Получить();
			
			Дата							= ТекущаяДата();
			ВидОперации						= Перечисления.ИТ_ВидыОперацийКорректировкиВзаиморасчетовСПродавцами.КорректировкаЗадолженности;
			ДокументОснование				= Основание;
			ЛинейныйМенеджер				= Основание.ЛинейныйМенеджер;
			ПланируемыйИсточникУдержания	= Перечисления.ИТ_ПланируемыеИсточникиУдержаний.ЗП;
			
			Если День(ТекущаяДата()) < ДеньМесяцаДляПериодаУдержания Тогда
				ПериодУдержания = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), -1));
			Иначе
				ПериодУдержания = НачалоМесяца(ТекущаяДата());
			КонецЕсли;
			
			Для Каждого СтрокаДляКорректировки Из ДанныеЗаполнения.ТаблицаДанныхДляКорректировки Цикл
				НоваяСтрокаКорректировки = Корректировки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаКорректировки, СтрокаДляКорректировки);
				НоваяСтрокаКорректировки.ПланируемыйИсточникУдержания = Перечисления.ИТ_ПланируемыеИсточникиУдержаний.ЗП;
				НоваяСтрокаКорректировки.ПериодУдержания = ПериодУдержания;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
